# -*- coding: utf-8 -*-

greeting_text = """
Отправь мне полный номер своей группы, чтобы получать актуальное расписание и узнавать, где следующая пара, всего в одно нажатие кнопки.

Пример группы: 111

Так же я могу сказать, где находится нужная тебе аудитория, для этого напиши мне: «где (№ аудитории)».

Пример: где 233

Вопросы и предложения пиши сюда:
Вк https://vk.com/ganzeroar
Почта ganzeroar@gmail.com

Если вы вдруг ошиблись в номере группы или сменили её, просто отправьте правильный номер ещё раз.
"""

group_saved = """
Теперь можно узнавать актуальное расписание с помощью одной кнопки.

Если вы вдруг ошиблись в номере группы или сменили её, просто отправьте правильный номер ещё раз.
"""

error = 'Если ты видишь это сообщение, значит что-то сломалось, но это временно. Пожалуйста, напиши мне вк или на почту ganzeroar@gmail.com номер группы, дату и время, когда бот прислал тебе это сообщение.'
        
invalid_text = """
Я тебя не понял!

Отправьте мне номер своей группы для закрепления ее за тобой.
Например: 111

Если у вас не появляется клавиатура, то отправьте боту один из этих вопросов
Какие завтра пары?
Когда на учебу?
Где пара?
""" 
