# -*- coding: utf-8 -*-

greeting_text = """
Отправь мне полный номер своей группы, чтобы получать актуальное расписание и 
узнавать, где следующая пара, всего в одно нажатие кнопки.

Пример группы: 111

Так же я могу сказать, где находится нужная тебе аудитория, для этого напиши 
мне: «где (№ аудитории)».

Пример: где 233

Вопросы и предложения пиши сюда:
Вк https://vk.com/ganzeroar
Почта ganzeroar@gmail.com

Если вы вдруг ошиблись в номере группы или сменили её, просто отправьте 
правильный номер ещё раз.
"""

group_saved = """
Теперь можно узнавать актуальное расписание с помощью одной кнопки.

Если вы вдруг ошиблись в номере группы или сменили её, просто отправьте 
правильный номер ещё раз.
"""

error = """Упс! Что-то сломалось! 😓

Ошибка будет исправлена в ближайшее время, но ты можешь помочь и ускорить 
процесс - отправь мне в Вк скриншот с сообщением об ошибке 
https://vk.com/ganzeroar или на почту ganzeroar@gmail.com

Заранее спасибо!"""
        
invalid_text = """
Я тебя не понял!

Воспользуйся специальными кнопками с командами или отправь 
один из этих вопросов:
Какие завтра пары?
Когда на учебу?
Где пара?
Где 223
""" 

mystical_error_text = """
Если ты видишь это сообщение, значит ты - тот самый редчайший пользователь, 
который каким-то необъяснимым образом меня сломал. Пожалуйста, свяжись с моим 
создателем в телеграме ( @ganzeroar) или вк, сообщи ему об этом. Тем самым ты 
сделаешь меня чуточку лучше и приблизишь момент нахождения и исправлния этой 
магической ошибки. Заранее спасибо =)
"""

havent_way_to_place = "Упс, у меня ещё нет местоположения этого места. Пожалуйста, не пожалей пары минут и напиши прямо сюда где оно находится, что бы я со временем добавил его к себе в базу."

text_for_greeting_after_new_year = """Привет! За зимние каникулы я многому научился. Теперь я могу отвечать на много новых команд, например:
какие пары в понедельник? ;
расписание на вторник ;
среда ;
на завтра ;
послезавтра и т.д.

Я научился обрабатывать почти всё что вы, студенты, мне писали в прошлом году.

Напоминаю, что я умею находить аудитории по команде: "где *номер аудитории*" (например "где 321").

Сейчас я учусь находить деканаты\факультеты\кафедры. Пиши мне сообщения, на которые хотел бы получать ответы.

Спасибо за активное пользование мной =)
"""